app/views/userinputs/new.html.erb

SELECT "vivocameras".* FROM "vivocameras"
---

    <%= f.collection_select(:vivocamera_id, Vivocamera.all, :id, :name) %>