app/controllers/ipcams_controller.rb

  def show
    @ipcam = Ipcam.find(params[:id])
---
SELECT  "ipcams".* FROM "ipcams" WHERE "ipcams"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @ipcam = Ipcam.new(ipcam_params)
    if @ipcam.save
---
INSERT INTO "ipcams" ("type1", "created_at", "updated_at") VALUES (?, ?, ?)  [["type1", "ddd"], ["created_at", "2015-01-01 12:03:02.963726"], ["updated_at", "2015-01-01 12:03:02.963726"]]