app/controllers/userinputs_controller.rb

  def index
  @userinputs = Userinput.all
---
SELECT "userinputs".* FROM "userinputs"

  def create
    @userinput = Userinput.new(userinput_params)
     @userinput.save
---
INSERT INTO "userinputs" ("property", "vivocamera_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["property", "1"], ["vivocamera_id", 1], ["created_at", "2015-01-12 14:30:18.487152"], ["updated_at", "2015-01-12 14:30:18.487152"]]

  def show
    @userinput = Userinput.find(params[:id])
---
SELECT  "userinputs".* FROM "userinputs" WHERE "userinputs"."id" = ? LIMIT 1  [["id", 0]]