app/controllers/vivocameras_controller.rb

SELECT  "vivocameras".* FROM "vivocameras" WHERE "vivocameras"."id" = ? LIMIT 1  [["id", 2]]
---
 def show
  @vivocamera=Vivocamera.find(params[:id])

SELECT "vivocameras".* FROM "vivocameras"
---
 def new
   @vivocamera=Vivocamera.new
   @vivocameras=Vivocamera.all

SELECT "vivocameras".* FROM "vivocameras"
---
 def index
  @vivocameras=Vivocamera.all

INSERT INTO "vivocameras" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "IP1"], ["created_at", "2015-01-12 07:53:37.018224"], ["updated_at", "2015-01-12 07:53:37.018224"]]
---
  def create
    @vivocamera = Vivocamera.new(vivocamera_params)
     @vivocamera.save

SELECT  "vivocameras".* FROM "vivocameras" WHERE "vivocameras"."id" = ? LIMIT 1  [["id", nil]]
---
 def edit
   @vivocamera = Vivocamera.find(params[:vivocamera_id])

SELECT  "vivocameras".* FROM "vivocameras" WHERE "vivocameras"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "vivocameras" SET "name" = ?, "updated_at" = ? WHERE "vivocameras"."id" = ?  [["name", "IP1aa"], ["updated_at", "2015-01-17 15:19:25.122229"], ["id", 1]]
---
 def update
   @vivocamera = Vivocamera.find(params[:id])

   @vivocamera.update_attributes(vivocamera_params)