app/controllers/vivocamera_userinputs_controller.rb

INSERT INTO "userinputs" ("bootuptim", "ir", "extir", "npir", "ndi", "nvi", "vivocamera_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

     @userinput = @vivocamera.userinputs.build(userinput_params)
    if @userinput.save

SELECT  "vivocameras".* FROM "vivocameras" WHERE "vivocameras"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "userinputs".* FROM "userinputs" WHERE "userinputs"."vivocamera_id" = ? AND "userinputs"."id" = ? LIMIT 1  [["vivocamera_id", 9], ["id", 9]]
---
  def edit
     @vivocamera = Vivocamera.find( params[:vivocamera_id] )
    @userinput = @vivocamera.userinputs.find(params[:vivocamera_id])

SELECT  "vivocameras".* FROM "vivocameras" WHERE "vivocameras"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "userinputs".* FROM "userinputs" WHERE "userinputs"."vivocamera_id" = ? AND "userinputs"."id" = ? LIMIT 1  [["vivocamera_id", 1], ["id", 1]]
UPDATE "userinputs" SET "bootuptim" = ?, "updated_at" = ? WHERE "userinputs"."id" = ?  [["bootuptim", "1a"], ["updated_at", "2015-01-17 15:06:07.664461"], ["id", 1]]
---
  def update
       @vivocamera = Vivocamera.find( params[:vivocamera_id] )
     @userinput = @vivocamera.userinputs.find( params[:vivocamera_id] )

     @userinput.update_attributes(userinput_params)

SELECT  "vivocameras".* FROM "vivocameras" WHERE "vivocameras"."id" = ? LIMIT 1  [["id", nil]]
---
  def find_vivocamera
    @vivocamera = Vivocamera.find( params[:vivocamera_id] )